Christmas Homework/Reddit_Clone/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "dk6Kr-DBcjb_L-IQ-0WETA"], ["LIMIT", 1]]