Christmas Homework/Reddit_Clone/app/controllers/subs_controller.rb

    def create
        @sub = current_user.subs.new(sub_params)
        if @sub.save
---
INSERT INTO "subs" ("owner_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["owner_id", 1], ["name", "testing"], ["description", "hello"], ["created_at", "2019-12-30 06:02:48.738502"], ["updated_at", "2019-12-30 06:02:48.738502"]]