Christmas Homework/Music_Rapp/app/controllers/albums_controller.rb

    def new
        @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)
        if @album.save
---
INSERT INTO "albums" ("name", "band_id", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "t"], ["band_id", 2], ["year", 2010], ["created_at", "2019-12-30 04:55:06.631640"], ["updated_at", "2019-12-30 04:55:06.631640"]]